
"genetically
"insulin
%)
%).
%,
&lt;
(
('seroquel')
(+)-nanm
(+)-nanm,
(+)-nanm.
(+/-
(-)-erythro-fluorocitrate
(-)-erythro-fluorocitrate.
(-)-nanm
(-)-nanm,
(0%).
(0.05
(0.075
(0.1
(0.125
(0.15
(0.2-0.5
(0.25
(0.3
(0.35
(0.375
(0.4
(0.5
(0.6
(0.7
(0.91,
(0.94,
(1
(1%
(1,200
(1,25(oh)2d3),
(1,3-difluoro-2-propanol),
(1-866-263-8483).
(1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine/3-[(2-methyl-1,3-thiazol-4-yl)
(1.1
(1.3%,
(1.5
(1.5-2.5
(1/10)
(10
(10%
(10%)
(10(-5)
(10(-8)
(10),
(10).
(10-20
(10-63%).
(10-78
(100
(100-500
(1000
(103),
(110-200
(114)%
(115),
(12
(12%
(12-120
(12-57
(120
(123i
(125
(13
(13),
(13.0
(14%-81%),
(15
(15%)
(15.0
(150
(1500
(16
(160
(162.5
(166
(17)%
(170
(18),
(18-mc)
(1968,
(2
(2-
(2.0
(2.2
(2.5+/-0.6
(20
(20%
(20%)
(200
(20mm),
(21.7%)
(22.0%).
(24%)
(24),
(240
(25
(25%)
(250
(269
(28-week)
(28.9%)
(29%
(29),
(29-40%).
(3
(3%
(3.2
(3.4
(3.5
(3.7
(3.9%
(30
(30%)
(30.7%).
(300
(3000
(31%).
(35%-90%),
(36%)
(375
(38),
(3900
(4
(40
(40%
(400
(45),
(450
(479
(48%)
(48%),
(48.59
(5
(5-35
(5-7.5
(5-dfcr);
(5-dfur,
(5.8+/-2.3
(50
(50%).
(500
(51
(52),
(53%)
(57%),
(58%)
(6
(6.25
(60
(60)
(600
(66%
(7-10/interaction
(7-54
(7.4
(7.5
(7.73
(72)
(74%)
(75
(8
(8.0
(8.5%,
(80%)
(80-95%)
(800
(81
(84%)
(88%)
(90
(90%
(90%).
(91%)
(93%)
(94%)
(95%
(99.5%
(<3
(=1
(>150
([ca(2+)](i))
(a
(a)
(aav2).
(about
(abt)
(accompanied
(ace)
(acei/arb).
(acetazolamide,
(acetophenazine
(acetylsalicylic
(ache)
(acidic)
(acs).
(acth)
(acth):
(active
(adcc).
(adenosine)
(administered
(adohcy)
(aeds)
(aeds),
(agenerase,
(ages
(alcohol,
(all
(allergy,
(allium
(alprazolam,
(also
(alt)
(altered
(although
(aluminum
(aluminum-
(aminoglycosides
(aminophylline
(aminophylline,
(amitriptyline,
(ammonium
(ampicillin,
(an
(anafranil),
(anaprox,
(anc
(and
(and/or
(another
(anticholinergic
(aom)
(approximately
(arrhythmia,
(arthropan),
(as
(asendin),
(ast),
(astramorph,
(at
(atenolol,
(atromid-s),
(atypical)
(auc
(auc(0-
(auc(ss))
(auc)
(auc,
(auc0-12)
(average
(avonex
(azole
(azulfidine);
(b)
(bactrim,
(barbiturates
(baseline
(basic),
(benedicts
(benign
(benzothiadiazines
(beta)-agonists,
(beta-blockers)
(bioavailability
(birth
(blood
(bolus-ifl)
(both
(bph),
(brilinta)--better
(brilinta-astrazeneca),
(brinzolamide
(bruising,
(but
(butenafine
(by
(c
(c12hr)
(ca.
(calan
(captopril
(carbamazepine,
(carbenicillin
(carbidopa)
(carboptic,
(causing
(caution
(cbg),
(cbz)
(cefazolin)
(cefmenoxime,
(celexa),
(characterized
(chlordiazepoxide)
(chop)
(cisplatin,
(clcr=15
(clotrimazole,
(clozapine,
(cmax
(cmax)
(cmax,
(cmc-cys)
(cmc-cys7.3)
(cmin)
(cns
(cns)
(coadministration
(cohort
(comet
(compared
(compazine),
(concurrent
(confusion,
(congestive
(consider
(corn
(corticosteroids,
(cortisone-like
(coumadin)
(cox-2)
(cp450)
(cpa),
(crbc)].
(creatinine
(crm197).
(cyp
(cyp)
(cyp):
(cyp1a2,
(cyp2c9
(cyp2c9*1/*1
(cyp2d6):
(cyp3a):
(cyp3a4
(cyp3a4)
(cyp3a4),
(cyp3a4,
(cyp450)
(day
(daypro),
(days
(decreased
(deltasone,
(depen,
(der).
(derived
(desyrel)
(dextromethorphan)
(dextromethorphan),
(dha)
(diabetes
(didanosine)
(didanosine),
(digoxin
(dihydroergotamine
(dilantin);
(dilantin,
(dipyridamole
(disalcid,
(disulfiram,
(diuril),
(dmf)
(dmpge2)-induced
(dpcpx),
(drl)
(drowsiness),
(drying)
(dsst),
(dtic)
(dznep),
(e.
(e.g.
(e.g.,
(e.w.)
(ecg)
(ee)
(efavirenz)
(efavirenz).
(efavirenz);
(efavirenz,
(effient)
(eg
(eg,
(elavil),
(enzyme
(ephedrine).
(epo)
(equivalent
(ergotamine,
(ermbt).
(erythromycin,
(esmolol
(especially
(ethosuximide)
(etodolac
(exercise
(exposure)
(extended
(extended-release
(fecal
(felbamate)
(females)
(fentanyl
(fi
(fici)
(finasteride,
(fluoxetine,
(flushing,
(following
(for
(formed
(formoterol
(fortovase)
(furafylline
(gantrisin),
(gavage)
(gfp),
(ginkgo
(given
(glucose
(gris-peg,
(gsls)
(guanethidine,
(hctz)
(hctz,
(heart
(hela,
(histamine
(hiv-nhl),
(hmg-coa)
(hmgcoa)
(hoof
(hplc),
(human)
(human).
(hydrochlorothiazide).
(hypertension)-
(hypnotics,
(hypoxanthine
(i)
(i.e.
(i.e.,
(idv),
(ie,
(iegs)
(ii)
(imiglucerase)
(imipramine,
(imuran),
(in
(including
(including,
(increased
(increases
(increasing
(inderal),
(indocin),
(indomethacin)
(indomethacin,
(inn,
(inr)
(inr).
(insp(3))-induced
(insulin,
(interferon,
(international
(intravenous
(ip),
(iron),
(ismelin).
(isoniazid)
(isradipine)
(isradipine),
(iv)
(kelly,
(kemstro)
(ketoconazole)
(kytril)
(l-type),
(lactulose
(lanoxin,
(later
(lbh589),
(lenalidomide)
(less
(leucovorin)
(levamisole
(levonorgestrel/ethinyl
(like
(lipitor),
(lng).
(lodine),
(lopressor),
(loratadine
(lorazepam,
(lovastatin,
(low
(lowering
(lst),
(m/m)
(m/v)
(maalox
(maalox)*
(magan),
(magnesium-aluminum
(males)
(many
(mao)
(mao),
(mao-is)
(maoi)
(maoi),
(maoi).
(maoi):
(maois)
(maois).
(marplan),
(max)
(maximum
(may
(mdp)-gentamicin
(mean
(measured
(medrol,
(mercaptopurine)
(metabolite
(metaproterenol
(meth)
(methoxyflurane)
(methsuximide)
(methylergonovine
(metoprolol,
(metronidazole
(mglur)
(mhd)
(mic)
(minimal
(minimum
(minipills
(miochol)
(mirtazapine)
(modified)
(motrin,
(mptp)
(mrsa).
(msec)
(mtt),
(muscle
(n
(n,
(n-type)
(n-type),
(n=
(n=10)
(n=12
(n=12)
(n=12),
(n=12).
(n=13)
(n=15).
(n=16)
(n=177),
(n=18)
(n=180)
(n=2)
(n=21),
(n=24)
(n=24,
(n=29).
(n=30)
(n=35),
(n=4),
(n=43)
(n=43).
(n=6)
(n=6),
(n=6).
(n=7)
(n=70),
(n=72),
(n=75),
(n=77),
(n=79),
(n=8)
(n=9),
(n=96)
(nacmc)
(nadolol,porpranolol,timolol)
(naflu)
(nandrolone
(nanm)
(nardil)
(nardil);
(neoral,
(neostgmine,
(niacin),
(niacin):
(nicotinic
(nizoral)
(nnrti)-based
(nnrtis):
(nonselective
(norethindrone
(norethindrone)
(norpramin).
(nsaid)
(nsaids)
(nsaids),
(nsaids)-a
(nsaids):
(nsaids,
(number
(nydrazid).
(nydrazid);
(nyha
(omeprazole)
(omeprazole,
(one
(one)
(only
(ophthalmic
(or
(oral
(oral):
(orudis,
(otc
(oxymetazoline),
(p
(p-type)
(p=0.006),
(paba)-containing
(pamelor),
(parnate),
(particularly
(pcp)
(pcp)-induced
(pd2
(pemoline)
(penicillins
(pepto-bismol);
(percentage
(pharmacokinetics)
(phenacemide)
(phenergan),
(phenobarbital
(phenobarbital,
(phenothiazines,
(phenylbutazone,
(phenytoin):
(phenytoin,
(pi)-related
(piroxicam),
(plavix)
(plendil)
(poc)
(potent
(ppis)
(pr,
(pra),
(predominantly
(prelone),
(prelone,
(presumptive
(primarily
(primidone)
(primidone):
(prolixin,
(prolonged
(propranolol).
(prothrombin
(prozac)
(psa)
(pt
(pt)
(pth)
(ptx),
(pulmozyme
(purinethol)
(r)
(r)-
(r+)-
(r=
(ra)
(radioenzymatic
(range
(range:
(rarely
(rbc)]
(rehospitalisation)
(relafen),
(reported
(reports
(reserpine,
(riboflavin):
(rifadin,
(rifampicin)
(rifampin),
(ritonavir).
(ritonavir,
(rivastigmine
(rocuronium
(rofecoxib
(ros)
(rosiglitazone
(rr)
(s)
(s)-warfarin,
(s-)-enantiomers
(salmon)
(sd)
(sectral),
(see
(seizures).
(self-reported
(serum
(severe
(sh/da;
(shbg))
(shbg),
(sinequan),
(single
(sodium
(sometimes
(spironolactone,
(sporanox)
(ssri)
(ssris)
(ssris),
(ssris):
(ssris,
(sst),
(statins)
(sub-g1
(such
(sulfa
(sumatriptan
(sumatriptan)
(sustained-release
(systemic)
(tagamet)
(tam),
(tao),
(tbg).
(tcas)
(tdm)
(tegretol)
(teniposide
(tenormin),
(thc)
(the
(theo-dur
(theo-dur),
(therapeutic
(thereby
(these
(thiamine):
(thiazide
(thiazides
(thin-layer
(thiocyanate,
(thorazine),
(three
(titrated
(tiva)
(tml)
(tmp/smx).
(tofranil),
(too
(total
(trecator-sc)
(tricyclic
(tricyclic),
(trilisate),
(tunel)
(twice
(two
(tylenol),
(typically
(u937
(ultram)
(ultram).
(unconjugated)
(unfractionated
(up
(urobilin)
(use
(used
(using
(valium)
(valium),
(vanillylmandelic
(verapamil),
(verapamil,
(vitamin
(vivactil),
(voltaren,
(warfarin)
(warfarin),
(water
(water).
(where
(which
(with
(without
(ze)
(zofran)
(zyvox
(~20
(~36%
(~40%)
(~7
)
))
).
):
*
**
*1).
+
+/-
,
-
--
-actin
-associated
-blockers,
-blocking
-hydroxy
-hydroxy-iso-pravastatin
-receptor
-treated
.
.002).
.004).
.005);
.014);
.017).
.13,
.76,
.82,
/
/35
0
0,
0-24
0-24,
0.001)
0.006)
0.01).
0.012
0.013),
0.022)
0.025
0.03
0.03).
0.05
0.05)
0.05),
0.05).
0.07
0.09-0.13
0.1
0.1-0.4
0.1-0.8
0.1-mg/kg
0.11
0.15
0.2
0.25
0.28
0.3
0.376,
0.4
0.44
0.5
0.5%
0.53
0.58-0.71.
0.6
0.62
0.68
0.7
0.7%
0.70
0.75
0.8
0.81
0.9
1
1%
1%,
1%.
1)
1,
1,000
1,25(oh)2d3
1,25-dihydroxycholecalciferol
1,3-difluoro-2-propanol
1,3-difluoro-2-propanol-intoxicated
1,3-difluoro-2-propanol.
1,3-difluoroacetone
1,3-difluoroacetone,
1,4,5-trisphosphate
1-
1-2
1-866-amevive
1-aminobenzotriazole
1-methyl-4-phenyl-1,2,3,4-tetrahydropyridine
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine-induced
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine.
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine/3-[(2-methyl-1,3-thiazol-4-yl)
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine/vehicle).
1-methyl-4-phenyl-1,2,3,6-tetrahydropyridine/vehicle-treated
1-methyl-4-phenyl-1,2,5,6-tetrahydropyridine
1-mg
1-month.
1-week
1-year
1.0
1.00
1.02
1.02-2.11]).
1.04
1.09),
1.1)
1.10),
1.11-2.38]),
1.13
1.14),
1.2
1.2.
1.230).
1.25
1.25-2.38]),
1.27-2.12]),
1.3
1.3).
1.30-2.35]).
1.34-fold
1.4-
1.47
1.5
1.5-fold
1.5-fold.
1.5.
1.6
1.6-
1.6-g
1.63
1.64
1.7-fold
1.7-fold.
1.7-gram
1.73
1.75
1.8
1.8-fold
1.8.
1/3
1/35
1/4
1/80
10
10%
10%)
10%,
10%.
10(-10)
10(-6)
10(-7)
10(-8)
10(-9)
10).
10,
10,11-epoxide,
10-
10-20%
10-day
10-fold
10-mg
10-monohydroxy
100
100%
100);
100-300
100-mg
1000
101
102
103
104
104-week
1072
109/l).
10th
11
11%
11%)
11%,
11%.
11),
11-28%)
11-fold
11.0%)
11.1
11.4
11.5
11.5%,
110%.
111
112%
1178
12
12%
12%,
12).
12,
12-fold
12-hour
12-month
12-week
12.
12.08
12.5
12.5,
12.6
12.6%
120
120-mg
1200
1200,
1200mg)
122%
123
1248
125
125%
125-mg
1252
125mg
128%
13
13%
13%,
13%-19%
13-fold
13.0%,
13.3-fold.
13.7
13.7%)
13.8
130
131i),
1324
14
14%
14%,
14%.
14)
14-
14-57,
14-day
14.2
1400
142
145
145mg
15
15%
15%,
15%.
15)
15,
15,000
15-20
15-fold
15-mg
15.
15.1
150
150-mg
1500
152%
156%,
16
16%
16%,
16%.
16).
16,
16,16-dimethylprostaglandin
16-34%)
16-fold
16.6
1602
163
17
17%
17%).
17%,
17-28%.
17-day-old
17.0
17.8
170
172
1732
18
18%
18%)
18%,
18%.
18-27]
18-41
18-mc
18-mc,
18-methoxycoronaridine
1800
187
188+/-42
19
19%
19%,
19%.
190
195
197
1970),
1984,
1986.
1999
1999).
1:1:1
1a2
1a2).
1a2,
1c
1mg
2
2%
2%.
2)
2,
2-
2-,
2-3
2-4
2-5
2-7))
2-fold
2-fold)
2-fold,
2-fold.
2-way
2-week
2.0),
2.0-
2.2
2.2-fold
2.2-fold,
2.3
2.3%
2.3-fold
2.4-fold,
2.5
2.5-
2.5-6
2.5-fold
2.6
2.7
2.9-
2.93-fold
2/3
2/3.
20
20%
20%,
20%.
20)
20).
20,
20-33].
20-mg
20.1%
20.1%,
200
200-mg
2000
2002
202.5
207%
20th
21
21%
21%,
21%.
21-day
21.
21.2%)
21680
21680,
22
22%
22%,
22.4%,
228.2
229
23
23%
23)
230
234
235.1
24
24%
24%,
24-hour
24-week
24.7%,
240
240+/-41
2400
25
25%
25%)
25%).
25%,
25%.
25,
25-mg
25-o-desacetyl
25-o-desacetylrifabutin
25-o-desacetylrifabutin,
250
250-mg
251%
26
26%
26%,
260%
261%
265
27%
27%,
277.5
28
28%
29
29%
29%.
2946
2a6
2a6,
2b6
2c19
2c19*1/
2c19,
2c8,
2c9
2c9)
2c9,
2cl9,
2d6
2d6,
2d6.
2e1,
2e1.
2o.
3
3%
3%,
3)
3,
3,7-dihydroxyflavone
3-
3-4
3-[(2-methyl-1,3-thiazol-4-yl)
3-day
3-deazaneplanocin
3-ethoxylated
3-fold
3-fold.
3-hydroxy
3-hydroxy-1,4-benzodiazepine
3-hydroxy-3-methylglutaryl
3-hydroxydesloratadine
3.
3.0+/-0.9
3.1
3.1%),
3.3-fold
3.5%
3.5-fold,
3.6
3.6-fold
3.8-fold,
30
30%
30%,
30%.
30)
30,
30-40%
30-fold.
30-mg
30-mg/day
30.8)
300
300-600
300-mg
3000
302%
3020
31%
31%,
310
314%
318
32%
321%
33
33%
33%,
33-46%
333-mg
34
34%
34%,
340
35
35%
35%,
35%.
350
350%
3500
354
36
36%
36%,
360
3600
367
369
37%
37%)
37.7%.
375-mg
38
38%
38%,
38%.
388
39%
39%,
39-57%,
39.1)
3:1.
3a
3a)
3a).
3a4
3a4)
3a4,
3a4.
3a4/5
3a:
3h-spiroperidol
3h-triglyceride
4
4%
4%,
4,
4,8,
4-6
4-fold
4-hour
4-hydroxy-estazolam
4-hydroxyatomoxetine.
4-hydroxytamoxifen
4-hydroxytolbutamide
4-methylpyrazole
4.55
4/47
40
40%
40%)
40%,
40%.
40-mg
400
400-mg
407,370
41%
42%
42%).
42%,
42.5%
43
43%
43%,
43%.
43.4
430,455
44%
442
446
45
45%
45%,
45%.
45-51)
45-52).
45-52):
45.
45.7
450
456):
457
46
46%
46%,
46%.
47%
48
48%
48%,
48-
49%
49-fold
49.1
49.6%.
49.9
493
494
4th
5
5%
5%)
5%,
5%.
5,
5-
5-6
5-fluorouracil
5-fluorouracil,
5-fluorouracil.
5-fold
5-fold).
5-fu
5-fu,
5-ht
5-ht1
5-ht1b/1d
5-ht3
5-htv
5-methyltetrahydro-folate
5-mg
5-oxo-desethylzaleplon
5.
5.1
5.4
5.4-fold
5.5
5.5-fold
5.7%
5.8
50
50%
50%)
50%),
50%,
50%.
50-mg
50/100
500
500-mg
5000
501
508
51%
52
52-week
528
53%
533/133
54
54%
54).
540
55%
55%.
56%
56.9%
57%
58
58%.
59+/-11
5])
5ht3
6
6%
6%,
6%.
6).
6,
6-
6-10
6-beta-naltrexol
6-day
6-deoxy
6-fold
6-mercaptopurine,
6-mg
6-month
6-mp/aza
6-thiouric
6.
6.0
6.13
6.2
6.4
6.5
6.6
6.8%
6.93+/-0.04
6/5
60
60%
60%,
60%.
60-mg
600
600-mg
60mg.
62%
625
63
63%
648
65
65%
662
67
67%
68
688
69
69%
6mna.
7
7%
7)
7,
7-day
7-fold
7.0,
7.1%
7.2
7.21+/-0.13,
7.22+/-0.18,
7.3%
7.30+/-0.11
7.35+/-0.04,
7.5
7.7
7.77+/-0.12,
7.86+/-0.09,
70
70%
70%,
70%.
70/30
72
72%
72%.
72-
72-hour
72.
723
73
736
74%
75
75%
75%.
75-mg
76
77%,
78
79
8
8%
8%,
8%;
8,
8-23%),
8-2698
8-2698,
8-cyclopentyl-1,3-dipropylxanthine
8-fold
8-phenyltheophylline,
8-week
8.1
8.5
8.52
8.8%)
80
80%
80%)
80%.
80)
80-85%
800
800-mg
804
81
81%
81).
82
82%
82%,
83%
84%,
845
85
85%
86
87
87.
873
9
9%
9,
9.2+/-1.8
9.9%
9.9-g/m2
9.93),
90
90%
900
901
94)
94.8%,
95%
96
96%
96.3
97%
97.5%,
98%
99.2%
99.3%)
99m-tco-4-injection
99mtc-mdp
99mtc-methylene
:
<
=
>
>75%
[(14)c]-diethyl
[(2-adamantyl)hexamethylenimine]
[800
[90%
[95%
[a
[as
[ci]
[diltiazem]
[dose-time
[e.g.,
[efficacy
[fdf],
[influence
[interaction
[long-sedation
[minimum
[n
[qd])
[quantitative
[ssris])
[ssris]).
[stimulation
[tcas],
[the
[verapamil]
a
a,
a-blockers,
a-chloralose
a-methyldopa).
a-strain
a-v
a.
a.c.
a.v.
a1-selective
a2-selective
a375
a5
a7
a:
aav2
aav2-mediated
abacavir
abacavir.
abased
abatacept
abc
abciximab)
abilify
ability
abl
abnormal
abnormalities
abnormalities.
abolish
abolished
abolished.
about
above
above)
above,
abraded
abrupt
absence
absent.
absolute
absorbed
absorbent-type
absorption
absorption,
absorption.
absorption:
absorption;
abstracts,
abt
abt-737
abt-737,
abt>diethyldithiocarbamate~tranylcypromine>ketoconazole.
abundance
abuse,
abuse.
acamprosate
acamprosate.
acarbose
accelerate
accelerated
accelerates
accelerating
accentuate
accentuated
accidents.
accompanied
accompany
accordance
according
accordingly,
accordingly.
account
account:
accounts
accumbal
accumbens,
accumbens.
accumbens;
accumulated
accumulation
accumulation.
accuracy
accutane
accutane.
ace
ace-inhibitors
ace-inhibitors.
ace-inhibitors:reports
acebutolol
acebutolol,
acei/arb.
acellular,
acenocoumarol
acenocoumarol,
aceon
acetaldehyde
acetaldehyde,
acetaldehyde;
acetaminophen
acetaminophen,
acetaminophen.
acetaminophen/phenobarbital.
acetaminophen/theophylline,
acetaminophen:
acetate
acetate),
acetate,
acetate.
acetazolamide
acetazolamide,
acetazolamide:
acetic
acetohydroxamic
acetyl-l-carnitine
acetylcholine
acetylcholinesterase
acetylsalicylic
achieve
achieved
achieved.
achievement
achieving
acid
acid)
acid),
acid).
acid,
acid-base
acid-catalyzed
acid.
acid/phenobarbital.
acid:
acid;amiodarone;anabolic
acid;fenoprofen;glucagon;hepatotoxic
acid;methyldopa;methylphenidate;metronidazole;miconazole;monoamine
acid;naproxen;oxolinic
acid;oxyphenbutazone;pentoxifylline;phenylbutazone;phenyramidol;phenytoin;prolonged
acidic
acidifying
acidity
acidity,
acids
acids,
acids.
acids:
acinar
acitretin
acitretin:
acquainted
acquired
acquisition
acromegalic
acromegaly
act
acth
acth.
acth:
acting
acting;sulindac;thyroid
actinic
action
action,
action.
actions
actions,
activase
activate
activated
activation
active
actively
activities
activity
activity,
activity--such
activity.
activity:
activity;
acts
acute
acute),
acute,
acutely
acyclovir
acyclovir,
acyclovir/ganciclovir
acyclovir/ganciclovir:
aczone
adcc.
add
added
added,
addiction
addictive
addicts)
addicts.
adding
addition
addition,
additional
additionally,
additive
additive,
additive.
adefovir
adeno-associated
adenocarcinomas
adenocarcinomas,
adenocard
adenocard.
adenosine
adenosine.
adenosine:
adequate
adequately
adhesion
adjoining
adjunctive
adjust
adjusted
adjusted,
adjusted.
adjusting
adjusting,
adjustment
adjustment.
adjustments
adjustments,
adjustments.
adjuvant
adjuvants
adl
adl-8-2698
admini,stered
administer
administered
administered,
administered.
administering
administration
administration,
administration-dosage
administration.
administration;
administration]
administrations
administrations.
adolescent
adrenal
adrenaline
adrenergic
adrenergic-blocking
adrenocortical
adrenocorticoids
adrenoreceptors
adsorbents
adsorption
adult
adult-onset
adults
adults.
advanced
advantages
adverse
adversely
adversely.
advice
advil,
advisable
advisable.
advised
advised,
advised.
advised:
aed
aed.
aeds
aeds.
aerobic
aerobic,
aerolizertm
aerosol
aeruginosa
aeruginosa,
aeruginosa.
aetiopathogenic--(for
affect
affected
affected.
affecting
affects
affinities
affinity
after
again
again,
against
age
age,
age.
aged
agencies
agent
agent)
agent,
agent.
agents
agents)
agents).
agents):
agents,
agents.
agents:
agents:some
agents;
agents]
aggrastat
aggrastat,
aggravated
aggravating
aggregation
aggregation,
aggregation.
aggression
aggressive
agitation
agitation,
agonist
agonist);
agonist,
agonist.
agonist/antagonist
agonists
agonists)
agonists,
agonists.
agranulocytosis
ai
aid
aids
aim
aimed
aims/hypothesis:
air
akathisia
akineton
albendazole
albicans.
albumin
albuterol
albuterol,
alcohol
alcohol's
alcohol)
alcohol).
alcohol,
alcohol-related
alcohol.
alcohol:
alcoholic
alcoholics
alcoholism).
alcohols
aldehyde
aldomet)
aldosterone
alendronate.
alert
alerted
alertness
aleve
aleve);
alfa
alfenta
alfenta.
alfentanil,
alfentanyl,
alimta
alimta.
aliskiren
aliskiren.
alkaline
alkalinizers:
alkalinizing
alkalizing
alkaloid
alkaloids
alkaloids,
alkaloids.
alkaloids:
alkeran
alkyating
alkylated
all
all,
all.
allegra
alleles
allergic
allograft
allopurinol
allopurinol,
allopurinol.
allopurinol:
allow
allowed
allowing
allows
almost
almotriptan
almotriptan.
alone
alone,
alone.
alone;
along
alosetron
alosetron)
alosetron,
alosetron.
alpha
alpha-
alpha-2
alpha-adrenergic
alpha-blocker
alpha-blockers
alpha-blockers,
alpha-blockers.
alpha-blockers:
alpha-lipoic
alphagan
alprazolam
alprazolam).
alprazolam):
alprazolam,
alprazolam.
alprazolam:
alprostadil
already
also
also,
alt
altabax,
alter
alteration
alterations
altered
altered.
altering
alternate
alternate-day
alternating
alternative
alternatively,
alternatives
although
altretamines
aluminum
aluminum,
aluminum-
aluminum-containing
aluminum.
aluminum/magnesium
aluminum;
alupent
alveolar
always
amantadine
amantadine,
amantadine.
amantadine:
ambulatory
ameliorate
american
ames
amevive
amide-type
amikacin
amikacin),
amikacin,
amikacin.
amiloride
amiloride)
amiloride),
amiloride,
amiloride,triamterene,
amine
amines
amines.
aminocaproic
aminoglutethimide
aminoglutethimide,
aminoglutethimide:
aminoglycoside
aminoglycoside.
aminoglycosides
aminoglycosides,
aminoglycosides.
aminoglycosides:
aminoglycosidic
aminophylline
aminophylline,
aminopyrine
aminosalicylate
aminosalicylates.
aminosalicylic
aminotransferases
amiodarone
amiodarone,
amiodarone-treated
amiodarone.
amiodarone:
amiodarone;
amitriptyline
amitriptyline)--commonly
amitriptyline);
amitriptyline,
amitriptyline:
amizyl
amlodipine
amlodipine,
amlodipine/valsartan
among
amount
amounts
amoxapine
amoxicillin
amoxicillin).
amoxicillin.
amphetamine
amphetamine,
amphetamine-paired
amphetamine.
amphetamines
amphetamines,
amphetamines.
amphotericin
amphotericin,
ampicillin
ampicillin,
ampicillin.
ampicillin/amoxicillin:
ampicillin/flucoxacillin,
ampicillin:
amplifies
amprenavir
amprenavir's
amprenavir,
amprenavir.
amrinone,
amyl
amylase,
an
anabolic
anabolin],
anadrol],
anaerobic
anaesthetised
anafranil
anafranil)
anagrelide
anagrelide,
anagrelide.
anakinra
anakinra,
anakinra.
anakinra:
analgesia
analgesia.
analgesic
analgesic.
analgesic/anti-inflammatory
analgesics
analgesics),
analgesics,
analgesics.
analgesics:
analgesics;
analog
analogs,
analogue
analogue.
analogues
analogues,
analogues:
analyses
analysis
analyze
analyzed
analyzed.
anaphylactic
anaphylactoid
anastrozole
anastrozole.
anavar],
and
and,
and/or
andcmin,
androgen
androgens
androgens,
andtolbutamide
andusing
anecdotal
anesthesia
anesthesia,
anesthesia.
anesthesia:
anesthetic
anesthetic,
anesthetics
anesthetics)
anesthetics,
anesthetics.
anesthetics/sedatives/hypnotics/opioids:
anesthetics;mefenamic
anesthetized
angina
angina)
angina.
angioedema,
angiomax
angiotensin
angiotensin-
angiotensin-converting
angiotensins
angiotensln
anhydrase
anhydrous
anileridine
animal
animals
animals,
animals.
anion
anion-exchange
anionic
anionic-binding
anions
anisindione,
anitagonism
anorectic
anorexia,
another
another.
anova.
antabuse
antabuse)
antabuse-like
antacid
antacid.
antacid:
antacids
antacids)
antacids,
antacids.
antacids:
antagonism
antagonism,
antagonist
antagonist)
antagonist,
antagonistic
antagonists
antagonists)
antagonists,
antagonists.
antagonists:
antagonize
antagonized
anti
anti-
anti-arrhythmic
anti-arrhythmics
anti-asthma
anti-cancer
anti-coagulant
anti-coagulants,
anti-cryptosporidial
anti-depressants
anti-depressants.
anti-depressants/anti-anxiety
anti-diarrhea
anti-factor
anti-glaucoma
anti-helminthic
anti-hiv
anti-hypertensive
anti-hypertensives
anti-infective
anti-infectives
anti-inflammatory
anti-malarial
anti-migraine
anti-parkinsonian
anti-peptic
anti-platelet
anti-proliferative
anti-pseudomonal
anti-resorptive
anti-tumor
anti-ulcer
anti-vitamin-k
antiacid,
antiaddictive
antianginal
antianginal,
antianginals
antianxiety
antiarrhythmic
antiarrhythmics
antiarrhythmics,
antiarrhythmics:
antiarrhythrnics
antibacterial
antibacterial.
antibacterials.
antibiotic
antibiotic,
antibiotics
antibiotics)
antibiotics).
antibiotics,
antibiotics-broad-spectrum
antibiotics.
antibiotics:
antibodies
antibodies,
antibodies.
antibody
antibody-dependent
anticancer
antichlolinergic,
anticholinergic
anticholinergic,
anticholinergic-containing
anticholinergic-like
anticholinergic-type
anticholinergics
anticholinergics,
anticholinergics:
anticholinesterase
anticholinesterases
anticholinesterases,
anticholinesterases:
anticipated
anticipated,
anticoagulant
anticoagulant),
anticoagulant,
anticoagulant.
anticoagulants
anticoagulants,
anticoagulants.
anticoagulants:
anticoagulants;
anticoagulation
anticonvulsant
anticonvulsant.
anticonvulsants
anticonvulsants,
anticonvulsants.
anticonvulsants:
antidepressant
antidepressant-warfarin
antidepressant;
antidepressants
antidepressants)
antidepressants,
antidepressants.
antidepressants.when
antidepressants:
antidiabetes
antidiabetic
antidiabetics
antidiabetics,
antidiabetics:
antidiarrheal
antidiuretic
antidotal
antiedematous
antiemetic
antiemetics
antiemetics,
antiepilepsy
antiepileptic
antiepileptic,
antiestrogen
antiestrogens.
antifibrinolytic
antifungal
antifungal,
antifungals
antifungals,
antifungals.
antifungals:
antigen
antiglaucoma
antigout
antihistamines
antihistamines)
antihistamines),
antihistamines).
antihistamines,
antihistamines.
antihistamines:
antihistaminics,
antihyperlipidemics
antihypertensive
antihypertensive,
antihypertensives
antihypertensives,
antihypertensives.
antihypertensives:
antiinflammatories,
antiinflammatory
antimalarials,
antimicrobial
antimigraine:
antiminth)
antimuscarinic
antimuscarinics,
antimycobacterial
antimycobacterial:
antimycotic
antimycotics
antimycotics,
antinaturetic
antineoplastic
antinociception
antinociceptive
antinonciceptive
antiparkinson
antiparkinsonian
antiparkinsonian-agents):
antiplatelet
antiplatelets
antiproliferative
antiprothrombinemic
antipsychotic
antipsychotics
antipsychotics,
antipyretics,
antipyrine
antipyrine,
antipyrine.
antipyrine:
antiretroviral
antiseptic
antistress
antithrombin
antithrombotic
antithrombotics
antithyroid
antituberculosis
antituberculous
antitumor
antitumour
antiviral
antivirals,
antizol
anxiety/depressive
anxiogenic
anxiolytic
anxiolytics,
any
aom
aorta
aorta.
aortic
apart
apart)
apnea,
apnea.
apokyn.
apomorphine
apomorphine.
apoptosis
apoptosis,
apoptosis.
apoptotic
apparent
apparently
appear
appearance
appeared
appears
appetite
applicable.
application
application.
applied
applying
appreciably
appreciated.
approach
approached
appropriate
appropriate,
appropriate.
appropriately
appropriately.
appropriateness
approved
approx.
approximate
approximately
apraclonidine
aprepitant
aprepitant,
aprepitant.
aptt
aquamephyton,
aqueous
arabinoside,
arachidonate-
aralen)
aramine
arava
arbutamine
arbutamine-mediated
arbutamine.
arc
ardeparin.
are
are:
area
area-under-the-curve
areas
arecoline
argatroban
arginine
arginine,
arimidex
aripiprazole
aripiprazole,
arise
arise.
arrest,
arrested
arrhythmia
arrhythmia.
arrhythmia..
arrhythmias
arrhythmias,
arrhythmias.
arrival
arrythmias
arrythmias,
arsenate
arsenate(as(v))
arterial
arteries
artery
arthralgia,
arthritis
arthritis,
arthritis.
article
artificial
aruonic
as
as(v)
as(v).
as,
as:
asa
ascertain
ascorbic
asparaginase)
asparaginase,
asparagine
aspecific
aspergillus
aspirin
aspirin)
aspirin):
aspirin,
aspirin-mediated
aspirin.
aspirin/acetaminophen:
aspirin/nonsteroidal
aspirin:
aspirins
assay
assay)
assay).
assay,
assay.
assays
assays).
assays.
assess
assessed
assessment
assessments
assigned
associated
association
association,
assumed
assure
ast
astemizole
astemizole*,
astemizole,
astemizole.
astemizole:
asthma
at
atac
atacand,
ataxia,
atazanavir
atazanavir,
atenolol
atenolol,
atenolol.
atg/alg,
atomoxetine
atorvastatin
atorvastatin,
atorvastatin.
atorvastatin:
atovaquone
atovaquone.
atoxic
atp,
atracurium
atracurium,
atrial
atrioventricular
atromid-s
atromid-s.
atrophy,
atropine
atropine)
atropine,
atropine-type
atropine.
atropinization
atrovent
attacks
attacks.
attempt
attempted.
attention
attenuate
attenuated
attenuates
attenuates,
attenuating
attenuation
attributed
attributed,
atypical
auc
auc(0-
auc(0-24)
auc(0-24),
auc(0-8).
auc(0-infinity),
auc(0-t)
auc(ss)
auc)
auc).
auc,
auc.
auc0-
auc0-12
auc0-120hr
auc0-24.
auc0-24hr
auc;
aucs
augment
augmented
augmentin
augments
august
auranofin
aureus
aureus,
aureus.
authors
autohaler
autoimmune
automaticity
autonomic
av
availability
availability.
available
available,
available;
avastin
avastin.
average
average.
averaged
avian
avoid
avoided
avoided,
avoided.
avonex
aware
aware,
awareness
axert
azathioprine
azathioprine,
azathioprine.
azathioprine/mycophenolate
azithromycin
azithromycin,
azithromycin.
azlocillin
azole
azole-type
azoles
azopt
azoxymethane
b
b),
b).
b,
b-
b-12,
b-acetyldigoxin
b-adrenergic
b-blocking
b-induced
b-lactam
b-lactams,
b.
b.i.d.
b.i.d.)
b.i.d.,
b1
b12
b12,
b12.
b2
b3
b6,
b:
bacilli.
bacillus
bacitracin
bacitracin,
back-up
background
background:
baclofen
bactercidal
bacteria.
bacterial
bactericidal
bacteriostatic
bad
balance
balanced
bananas,
bar-press
baraclude
barbituates.
barbiturates
barbiturates)
barbiturates),
barbiturates,
barbiturates.
barrier
basal
base)
base-secreting
based
baseline
baseline.
bases
basic
basis
basis)
basis,
basis.
bcl-2
bcl-2,
be
be,
beadministered
bear
because
becausedecreases
become
bedtime
been
before
before,
began
begin
beginning
beginning,
begins
begun
begun.
behave
behavior
behavior.
behavioral
behavioral,
behaviors
behavioural
being
believed
belladonna
below
below,
below.
below:
benazepril,
beneficial
benefit
benefits
benign
bentiromide
benzocaine
benzodiazepenes
benzodiazepine
benzodiazepine)
benzodiazepine,
benzodiazepines
benzodiazepines),
benzodiazepines,
benzodiazepines.
benzodiazepines:
benzothiazepine
benzoxazinorifamycin,
benzthiazide
benzyl
benzylpenicillin,
bepridil
bepridil,
besides
best
beta
beta-1a
beta-adrenergic
beta-adrenergic-blocking
beta-adrenoceptor
beta-agonist
beta-agonists
beta-agonists,
beta-blockade.
beta-blocker
beta-blockers
beta-blockers),
beta-blockers,
beta-blockers.
beta-blockers.)
beta-blockers:
beta-blocking
beta-carotene
beta-endorphin
beta-endorphin,
beta-glucuronidase
beta-interferon
beta-lactam
beta-lactamtype
beta-receptor
beta.
beta2
beta2-agonist
beta2-agonists,
beta2-agonists.
beta2-agonists:
betablockers,
betagan
betaseron
betaseron.
bethanechol.
better
between
beverages
beverages.
beverages;
bexarotene
bexarotene,
bextra
beyond
bezafibrate.
bezalip
bicarbonate
bicarbonate,
bicnu)
bid
bid)
bid),
bid,
biguanides
bile
bile,
bile-acidsequestering
biliary
bilirubin
biloba).
bind
binding
binding),
binding,
binding-based
binding.
binds
bio-rad
bioassay
bioavailability
bioavailability,
bioavailability.
bioavailability;
bioavailabillty
biochemical
bioenhancer
bioequivalent
biogen
biologic
biological
biopharmaceutical
biotransformation
bipolar
birth
bishydroxy-coumarin
bishydroxycoumarin
bishydroxycoumarin,
bishydroxycoumarin.
bismuth
bismuth:
bisphosphonates
bitolterol
bivalirudin
bleeding
bleeding,
bleeding.
bleomycin)
bleomycin,
blind,
blinded,
block
block,
block.
block;
blockade
blockade.
blocked
blocker
blocker,
blocker.
blockers
blockers)
blockers),
blockers,
blockers.
blockers/proton
blockers:
blocking
blocks
blocks)
blood
blood),
blood-glucose-lowering
blood-pressure-
blood-sugar-reducing
blood.
blot
blunt
blunted
blunting
blunts
blurred
body
body.
bodyweight
bolus
bolus-ifl
bombesin
bombesin-enhanced
bombesin.
bone
boric
borne
bosentan
bosentan-
bosentan.
both
botox
botulinum
bound
bound,
bovine
bowel
bp
bp,
bradycardia
bradycardia,
bradycardia.
brain
brain;
brand
breakdown
breakfast
breaks
breakthrough
breast
breath
bred
bretylium
brevibloc
brevibloc,
brief
british
broad
broad-spectrum
broadly
bromide
bromide)
bromocriptine
bromocriptine,
bronchodilators
bronchodilators,
bronchospasm
brovana
brovana,
budesonide
budesonide.
buffer
buffered
buffering
buforin
bullous
bumetanide
bumetanide)
bumetanide,
bumetanide-induced
bumetanide.
bun,
buprenorphine
buprenorphine)
buprenorphine,
bupropion
bupropion,
bupropz_od.htm#ci
buspirone
buspirone,
busulfan
busulfex
busulfex.
but
butalbital
butalbital,
butorphanol
butorphanol,
butyrophenone
butyrophenones
butyrophenones,
bw
bwt
by
c
c)
c-17
c.
c.p.a.
c.p.a..
c129h223n3o54,
c57bl/6
c;warfarin
ca(2+)
cabergoline,
caffeine
caffeine,
caffeine-containing
caffeine-related
caffeine.
caffeine:
calcidiol):
calcineurin
calcitonin
calcitriol,
calcitriol/ergocalcitriol
calcium
calcium,
calcium-blocking
calcium-channel
calcium-channel-blocking
calcium-containing
calcium-entry
calcium-rich
calcium;
calculus
calling
camp,
camp-stimulated
campath
camptosar
camptosar,
can
can,
cana
cancer
cancer,
cancer.
cancers
cancers,
cancers.
cancidas
candesartan
candida
candida.
canine
cannabinoids,
cannot
capable
capacity
capecitabine
capecitabine).
capsule
capsule)
capsules
capsules)
capsules.
capsules:
capsules;
captopril
captopril's
captopril,
captopril-digoxin
captopril.
carbachol
carbachol)
carbachol-stimulated
carbamate
carbamazepine
carbamazepine)
carbamazepine).
carbamazepine,
carbamazepine.
carbamazepine:
carbenicillin
carbenicillin,
carbidopa
carbidopa-levodopa
carbidopa/levodopa
carbidopa/levodopa:
carbimazole,
carbimazole.
carbodiimide
carbohydrate-splitting
carbonate
carbonate,
carbonate.
carbonate:
carbonic
carboxylated
carboxymethylcellulose
carboxymethylcellulose-cysteine
carboxytolbutamide
carcinogenesis
carcinogenesis,
carcinogenicity
cardiac
cardiac,
cardio
cardioactive
cardiology.
cardioplegic
cardiopulmonary
cardioselective
cardiotoxic
cardiotoxicity
cardiotoxicity.
cardiotrast,
cardiovascular
cardiovasculars:
care
careful
carefully
carefully,
carefully.
carinii
carmustine
carmustine,
carried
carrier
carvedilol
carvedilol,
cas,
cascade
case
case-control
cases
cases,
cases.
casodex
caspofungin
catabloism
catabolic
catabolism
cataflam),
catalyzed
catecholamine
catecholamine-depleting
catecholamines
catecholamines,
catecholamines.
categories
categories:
category
category,
cation
cation-containing
cationic
cations
cations,
cations.
causal
causation.
cause
cause-and-effect
caused
causes
causing
caution
caution).
caution,
caution.
cautioned
cautious
cautiously
cautiously,
caverject:
cavity
cci-779
ccnu
ccnu,
ccnu.
cdk1
cdna
cecectomized
cecum
cefamandole
cefamandole,
cefazolin
cefazolin,
cefdinir
cefdinir,
cefdinir.
cefditoren
cefditoren,
cefixime
cefizox,
cefoperazone,
cefotan
cefotaxime
cefotetan
cefotetan,
cefoxitin
cefprozil
cefprozil.
ceftazidime,
ceftibuten
ceftibuten;
celebrex
celecoxib
celecoxib,
celexa
cell
cell,
cells
cells,
cells.
cells.14
cells;
cellular
celontin
central
centrally
cephalexin
cephaloridine
cephalosporin
cephalosporins
cephalosporins)
cephalosporins,
cephalosporins-cephalosporins
cephalothin
cephalothin,
cereals)
cerebral
cerebri
cerebrovascular
cerebyx
cerezyme
cerezyme.
cerivastatin
cerivastatin,
certain
certainly,
cerubidine
cerubidine)
cerubidine.
cerulein,
cerulein--an
cervical
cessation
cessation,
cetirizine
cetirizine,
cevimeline
cgs
cgs21680
chains
challenge.
chance
change
change,
changed
changed.
changes
changes,
changes;
changing
channel
channel,
channel-blockers,
channel-blocking
channel.
channels
channels,
characteristic
characteristics
characterization
characterize
characterized
characterized,
charcoal
charcoal)
charcoal,
chboramphenicol,
check
checked
checkerboard
cheese
chelates
chelating
chelation
chelation,
chemet
chemical
chemically
chemosensitizer
chemotherapeutic
chemotherapy
chemotherapy),
chemotherapy-induced
chemotherapy:
chewable/buffered
chewable/dispersible
chick
chicken
chickens
chickens.
chicks
child
childbearing
children
children.
chinese
chirocaine
chirocaine.
chloral
chloramphenicol
chloramphenicol),
chloramphenicol).
chloramphenicol,
chlordiazepoxide
chlordiazepoxide,
chlordiazepoxide.
chloride
chloride)
chloride):
chloride,
chloride-induced
chloride.
chloromycetin),
chloroprocaine
chloroquine
chloroquine)
chloroquine,
chloroquine;
chlorothiazide
chlorotrianisene
chlorpheniramine).
chlorpromazine
chlorpromazine),
chlorpromazine,
chlorpromazine.
chlorpromazine:
chlorpropamide
chlorpropamide)
chlorpropamide,
chlorpropamide:
chlorpropamides
chlorprothixene
chlortetracycline,
chlorthalidone
chlorthalidone,
choice
cholecystokinin
cholecystokinin--of
cholesterol
cholesterol,
cholesterol-lowering
cholesterol:
cholestographic
cholestryramine),
cholestyramine
cholestyramine,
cholestyramine-concomitant
cholestyramine:
cholestytamine
choline
cholinergic
cholinesterase
cholino-
cholinomimetics
chondroitin
chop
chop-like
chromaffin
chromatin
chromatographic
chromatographic-mass
chromatography.
chronic
chronically
chronotropic
chylomicron
chylomicron-like
ci
ci,
ci/kg
ci:
ciclesonide
ciclesonide.
ciclosporin)
cigarettes
cilexetil
cilostazol
cime-tidine
cimetidine
cimetidine)
cimetidine).
cimetidine,
cimetidine.
cimetidine:
cimetidines
cimetldine:
cinacalcet
cinoxacin
cinoxacin,
ciprofloxacin
ciprofloxacin)
ciprofloxacin,
ciprofloxacin.
circulating
circulation,
circulation.
circulatory
circumstance.
circumstances,
circumstances.
cis-platinum,
cisapride
cisapride,
cisapride.
cisapride:
cisapride;
cisplatin
cisplatin).
cisplatin,
cisplatin.
cisplatin.1
citalopram
citalopram,
citalopram.
citrate
citrate,
clarithromycin
clarithromycin(1),
clarithromycin)
clarithromycin),
clarithromycin).
clarithromycin,
clarithromycin,such
clarithromycin.
class
class,
class.
classes
classes),
classified
clear
clearance
clearance,
clearance.
clearance.)
clearances
cleared
clidinium
clidinium.
clindamycin
clindamycin,
clinical
clinically
clinically-
clinically-relevant
clinically.
clinician
clinicians
clinistix
clinitest
clo-4-
clobazam,
clofazimine,
clofibrate
clofibrate,
clofibrate.
clofibric
clomipramine
clomipramine,
clonazepam
clonazepam,
clonazepam.
clonazepam:
clonidine
clonidine,
clonidine.
clonidine.it
clonidine:
clonidines
clopidogrel
clopidogrel's
clopidogrel-treated
clopidogrel.
clorazepate
close
closely
closely,
closely.
clostridium,
closure.
clotibrate
clotrimazole,
clotrimazole.
clotting
cloxacillin
cloxacillin,
cloxacillin.
clozapine
clozapine,
clozapine.
cm3,
cmax
cmax)
cmax,
cmax.
cmc-cys,
cmc-cys7.3
cmi
cmin
cmin,
cmv
cns
cns,
cns-active
cns-depressant
cns-depressive
cns-impairing
co
co-
co-administer
co-administered
co-administered,
co-administered.
co-administration
co-administration,
co-administration.
co-administration:
co-infected
co-injection
co-medications
co-treatment
coadministered
coadministered),
coadministered,
coadministered.
coadministering
coadministration
coadministration),
coadministration,
coadministration.
coadminstered
coagulation
coat-core
coated
coating
cobalt
cobalt.
cobalt;
cocaine
cocaine-induced
codeine
codeine),
codeine.
coelenterates
coenzyme
coeruleus
coeruleus/a5/a7
coexistence
coexisting
coffee)
cognitive
cohort
cohorts
coincide,
coingestion
colazal,
colchicine
colchicine.
cold
cold,
colestid
colestipol
colestipol-concomitant
colestipol:
coli
coli,
colistemethate),
colistimethate),
colistin,
colitis)
collagen-stimulated
collagenase
collagenase,
collapse
collapse.
collected
colon.
colonic
colonies
color
colorectal
coly-mycin
coma
coma.
combination
combination)
combination,
combination.
combinations
combinations,
combine
combined
combining
comedication,
comes
commentaries
commercially
committed
common
commonly
comparable
comparable.
comparative
comparatively
compared
comparing
comparison
comparisons
compassionate
compatibility
compatible
compazine],
compensate
compensatory
compete
competes
competing
competition
competitive
competitively
complete
completed
completely
completion
complex
complex.
complexes
compliance,
complicated
complication
complications
complications,
complications.
component
components
components,
components.
compound),
compound,
compounds
compounds)
compounds,
compounds.
compounds;
comprehensive
compromise
compromise)
compromised
concealed
concentrate
concentrate)
concentrated
concentrates
concentrating
concentration
concentration)
concentration,
concentration-dependent
concentration-responses
concentration-time
concentration.
concentration]
concentrations
concentrations)
concentrations,
concentrations.
concentrations:
concentrations;
concern
concerning
concerns
conclude
concluded
conclusion
conclusion,
conclusion:
conclusions
conclusions/interpretation:
conclusions:
conclusive
concomitan
concomitant
concomitantly
concomitantly,
concomitantly.
concurent
concurrent
concurrently
concurrently,
concurrently.
condensation.
condition
conditioned
conditions
conditions,
conditions.
conducted
conducted,
conducted.
conducting
conduction
conduction,
conduction.
conductivity,
confidence
confirm
confirmation
confirmed
confirmed.
conflicting
confusion,
confusional
congeners
congeners.
congenital
congestive
conivaptan
conjugated
conjugates
conjugation
conjugation.
conjugation;
conjunction
connection
conscious
consciousness
consecutive
consequence
consequence,
consequences
consequent
consequently,
conservatively
consider
considerable
considerably
consideration
consideration.
considered
considered,
considered.
considering
consisted
consistent
consisting
constant,
constellation
constipation,
constitute
constitutes
constriction
consulting
consume
consuming
consumption
contain
contained
containing
contains
content
content,
contents
context
contin),
continue
continued
continuous
continuously
contortrostatin
contortrostatin,
contortrostatin-induced
contra-indication:
contraception
contraceptive
contraceptive,
contraceptive:
contraceptives
contraceptives(3),
contraceptives).
contraceptives,
contraceptives.
contraceptives:
contraceptives;
contraceptives;paraldehyde;primidone;ranitidine*;rifampin;unreliable
contractile
contractility
contractility,
contraction
contraction;
contradictory
contraindicated
contraindicated,
contraindicated.
contraindicated:
contraindications)
contraindications).
contrary,
contrast
contrast,
contribute
contributed
contributing
contribution
control
control)
control).
control.
controlled
controlled,
controlled-release
controls
controls.
convenient
conventional
conversely,
conversion
convert
converted
converting
convulsions
convulsions.
convulsions;
coombs
copaxone
copd
copegus
copegus,
copper
copper-reduction
copying
cordarone
cordarone)
core
coreg
coreg.
corneal
coronary
corrected
correlated
corresponded
corresponding
cortex
cortical
cortico-steroids
corticosteroid
corticosteroids
corticosteroids).
corticosteroids,
corticosteroids.
corticosteroids:
corticotropin
corticotropin,
cortisol
cost
costs
costs,
cotreatment
cough
could
could,
coumaphos
coumaphos,
coumaphos/kg
coumaphos/kg/day.
coumarin
coumarin,
coumarin-derivative
coumarin-like
coumarin-type
coumarins
coumarins,
counteract
counteracted
counts
counts.
coupled
course
covalently
cp450
cpa.
cpk.
cr,
crbc)
cream)
cream,
create
creates
creatinine
creatinine,
cremophor
crescentic
crises
crises,
crisis
criteria.
critical
crixivan
crixivan,
crixivan.
crm197
crohn
crohns
cromolyn
cross
cross-over
cross-reacting
cross-reactivity
cross-resistance
crossover
crossover,
crude
crushed
cryptosporidium
crystalline
csf
css,max
culture
culture)
culture.
cumulative
cuprimine),
cups
curare-like
curariform
cure
cure,
current
currently
curve
curve,
curve.
curves
curves.
cycle
cycle,
cycle.
cycles.
cyclic
cycling
cyclooxygenase-2
cyclopentolate
cyclophosphamide
cyclophosphamide)
cyclophosphamide),
cyclophosphamide).
cyclophosphamide,
cyclopropane
cycloserine
cyclosporin
cyclosporin).
cyclosporin,
cyclosporin.
cyclosporin:
cyclosporine
cyclosporine).
cyclosporine,
cyclosporine-induced
cyclosporine-treated
cyclosporine.
cyclosporine:
cylert
cyp
cyp-2c19
cyp-450
cyp1a1,
cyp1a2
cyp1a2),
cyp1a2,
cyp1a2-mediated
cyp1a2.
cyp1a2:
cyp2a6
cyp2a6,
cyp2b6
cyp2b6,
cyp2c19
cyp2c19,
cyp2c8
cyp2c8,
cyp2c8.
cyp2c9
cyp2c9,
cyp2c9.
cyp2d6
cyp2d6),
cyp2d6,
cyp2d6.
cyp2d6:
cyp2e1
cyp2e1,
cyp3a
cyp3a),
cyp3a,
cyp3a.
cyp3a4
cyp3a4)
cyp3a4,
cyp3a4-mediated
cyp3a4.
cyp3a4/5.
cyp3a5)
cyp3a:
cyp450
cyp450s
cyp4a11)
cyp4a9
cypermethrin
cypermethrin,
cypermethrin-induced
cyps
cyst
cysteine
cystic
cytadren
cytochalasin
cytochrome
cytochromes
cytokines
cytometry.
cytoprotective
cytosine
cytostatic
cytotoxic
cytotoxicity
cytotoxicity.
d
d,
d-ala2-metenkephalinamide,
d-amphetamine
d-amphetamine.
d-penicillamine,
d.
d.h.e.
d1
d2
d2,
d2-antagonists,
d3
d3,
d:
dacarbazine
dacarbazine,
dactinomycin
daily
daily)
daily),
daily).
daily,
daily.
daily]
dalfopristin,
damage
damage,
damage.
danazol
danazol,
danazol:
danger
dangerous
dantrium
dantrium)
dantrolene
dantrolene,
dapsone
dapsone,
daptomycin
darbepoetin
dasatinib
dasatinib,
dasatinib-
dasatinib-enhanced
dasatinib-mediated
data
data,
data.
database
database,
date
date,
daunorubicin
day
day)
day),
day).
day,
day.
day5
day9
days
days)
days),
days).
days,
days.
dcg-iv
dcg-iv,
de
deacetylase
death
death,
death.
deaths
deb
debrisoquin,
debrisoquin:
decamethonium
decarboxylase
decided
decision
decline
declines.
declining
decongestant
decongestants
decongestants.
decrease
decrease,
decreased
decreased)
decreased.
decreased;
decreases
decreasing
deeper
deet
defect
defense
deferasirox
deferens.
deferred
deficiencies
deficiencies;diflunisal;disulfiram;drugs
deficiency
deficiency.
deficit
define
defined
definite
definitely
definitively
degenerative
degrading
degree
degree,
degrees
degrees.
dehydration
dehydro-aripiprazole.
dehydroaripiprazole
dehydroaripiprazole,
dehydrogenase
delavirdine
delavirdine)
delavirdine).
delavirdine,
delavirdine-based
delay
delayed
delayed-release
delayed.
delaying
deleted
deleterious
deletion
delirium
delirium,
delivered
delivery
delta(1)-,
demonstrate
demonstrated
demonstrated.
demonstrates
demser
denotes
density
dental
denudation,
deoxycytidine
deoxynucleotidyl
depakene)
depakote)
departments
departure.
depend
dependence
dependent
dependent.
depending
deplete
depleting
depletion
depletion,
depletion.
depletions
depletor
depletors
depo-subq
depress
depressant
depressant,
depressants
depressants,
depressants.
depressants..
depressants:
depressants;
depressasnts
depressed
depresses
depression
depression):
depression,
depression-producing
depression.
depressive
depth
depth,
derivative
derivative,
derivatives
derivatives,
derivatives.
derivatives:
derive
derived
des-ciclesonide
desacetyldiltiazem,
desbutyl
descarboethoxyloratadine
descending
describe
described
described.
describes
describing
desethylamiodarone
desethylamiodarone.
desethyloxybutynin.
desethylzaleplon
desflurane
desglymidodrine
design
design.
designed
desipramine
desipramine).
desipramine,
desipramine.
desirable
desired
desired.
desloratadine
desloratadine,
desmethylastemizole
desmethylastermizole
desmethyldiazepam),
desmethyldiltiazem
desmopressin
despite
detail
detect
detectable
detected
detected.
detected..
detector.
deterioration
deterioration.
determinant
determination
determinations
determinations.
determinations;vitamin
determinations;warfarin
determine
determined
determined.
detoxification
detrol
develop
develop.
developed
developing
development
development,
deviation)
device
dexamethasone
dexamethasone),
dexamethasone,
dexamethasone.
dexamethasone:
dexamethasone;
dexbrompheniramine
dexfenfluramine
dexfenfluramine.
dexmedetomidine
dexmedetomidine-induced
dexmedetomidine.
dextran)
dextran,
dextran.
dextromethorphan
dextromethorphan,
dextromethorphan:
dextropropoxyphene
dezocine
diabectics
diabetes
diabetes)
diabetes,
diabetic
diabetics
diabetics,
diabetics.
diagnosed
diagnosis
diagnostic
dialysis,
dialysis.
dialyzed
diamond
diamox
diarrhea
diarrhea,
diarrhea.
diasone)
diastolic
diazepam
diazepam)
diazepam).
diazepam,
diazepam.
diazepam:
diazoxide
diazoxide,
diazoxide.
diclofenac
diclofenac,
diclofenac.
diclofenac:
dictate
dictates
dicumarol
dicumarol,
dicumarol.
dicumarol:
dicyclomine,
did
didanosine
didanosine,
didanosine-placebo
didanosine.
didanosine:
dideoxyinosine
dideoxyinosine.
didrex
died
diepoxybutane
diet
dietary
dietary-obese
diethyl
diethylpropion
diethylpropion.
diethylstilbestrol),
diets
diets,
differ
differed
difference
differences
different
differential
differential-reinforcement-of-low-rates
differently
differin
difficulty
diffusible
diffusion
diflucan
diflucan.
diflunisal
diflunisal.
diflunisal/acetaminophen)
digestion
digestive
digi-
digit
digital
digitalis
digitalis,
digitalis.
digitalis:
digitalized
digitalized,
digitoxin
digitoxin,
digitoxin.
digoxin
digoxin)
digoxin).
digoxin,
digoxin-amiodarone
digoxin.
digoxin/placebo
digoxin:
digoxin;
dihydroergotamine
dihydroergotamine)
dihydroergotamine,
dihydroergotamine.
dihydropyridine
dihydropyridine:
dihydrotachysterol
dilantin)
dilatation;
dilation
dilaudid
diltiazem
diltiazem)
diltiazem),
diltiazem,
diltiazem.
diltiazem:
diluent.
dimenhydrinate
diminish
diminished
diminishes
diminishing
diminution
dinitrate
dinitrate,
dinoprost
diphen-hydramine
diphenhydramine
diphenhydramine),
diphenhydramine,
diphenhydramine:
diphenidol
diphenidol;
diphenoxylate
diphenoxylate,
diphenylhydantoin,
diphosphonate
dipivoxil,or
dipotassium
diprivan
dipstick
dipyridamole
dipyridamole,
dipyridamole.
dipyrone):
direct
directed
directly
dirithromycin
dirithromycin.
disalcid
disc
discernible
discontinuance
discontinuation
discontinue
discontinued
discontinued,
discontinued.
discontinues
discontinuing
discontinuing,
discriminate
discrimination
discussing
discussion:
disease
disease,
disease.
disease]
disintegrating
disintegrin
disintegrin,
disintegrins
disodium
disoproxil
disopyramide
disopyramide,
disorder
disorder,
disorder.
disorders
disorders,
disorientation,
displace
displaced
displacement
displaces
displacing
display
displayed
disposition
disposition.
disruption
disruptive
disrupts
dissolution
dissolution,
dissolving
distilled
distinct
distinctive
distribution
distribution,
disturbance
disturbances
disturbances,
disturbances.
disturbing
disulfiram
disulfiram,
disulfiram-ethanol
disulfiram-like
disulfiram.
ditropan
diuretic
diuretic)
diuretic,
diuretic-induced
diuretic.
diuretic:
diuretics
diuretics)
diuretics),
diuretics).
diuretics,
diuretics.
diuretics:
divalent
divalproex
divergently
divided
dmpge2
dmpge2,
dna
do
dobutamine
dobutamine,
docetaxel
doctor
document
documentation
documented
documenting
dodecyl
does
dofetilide
dofetillide
dogs
dogs,
dogs.
dogs]
dolasetron
dolasetron,
domestic
done
done,
donor
dopamine
dopamine,
dopamine-induced
dopamine.
dopamine2-
dopaminergic
dornase
dorzolamide,
dosage
dosage,
dosage.
dosages
dosages)
dosages.
dose
dose)
dose),
dose).
dose,
dose-dependent
dose-dependently
dose-related
dose-response
dose.
dosed
doses
doses)
doses,
doses.
dosing
dosing,
dosing.
dostinex
double
double-blind
double-blind,
doubled
doubled.
doubling
downward
doxapram
doxazosin
doxazosin,
doxazosin.
doxepin
doxil
doxorubicin
doxorubicin)
doxorubicin,
doxorubicin.
doxorubicin:
doxorubicinol)
doxycycline
doxycycline,
doxycycline.
doxylamine
dpcpx-induced
dramatically
drawn
dried,
drinking
drl
drop
droperidol
droperidol,
droperidol.
dropped
drops
drops.
drowsiness
drowsiness-causing
drowsy.
drs
drug
drug,
drug-
drug-drug
drug-induced
drug-interaction
drug-metab-olizing
drug-metabolizing
drug-paired
drug.
drug/
drug/added
drug/drug
drug/laboratory
drug/laboratorytest
drugs
drugs,
drugs.
drugs.1,3
drugs/substances
drugs:
drugs:drugs
drugs;ibuprofen;indomethacin;influenza
drugs;tolbutamide;triclofos
dry
dryness
dsm-iv-diagnosed
dsst
dtic
dtic.
dual
due
duloxetine
duloxetine-treated
duloxetine.
duloxetine:
duodenal
duodenum
duragesic
duration
duration,
durations
during
during,
dutp
dynacirc
dynamic
dyphylline
dyscrasia:
dysesthesia.
dysfunction
dysfunction,
dysfunction.
dyskinesia
dyspnea
dyspnea,
dyspnea.
dysregulation
dysregulation.
dysrhythmias
dysrhythmias)
dysrhythmias,
dznep
e
e,
e-strain
e.
e.g.
e.g.,
e.w.)
e2
ea
each
earlier
early
early-phase
earth
easy
ec50
ecg
ecg.
echistatin
ectopic
ectopy.
ed50
ed95)
edecrin
edema
edema,
edema.
edema]
edemas
edetate
edisylate.
editorials
edrophonium
edta
efavirenz
efavirenz,
efavirenz.
efavirenz;has
effect
effect),
effect,
effect-time
effect.
effect:
effected
effective
effective,
effective.
effectively
effectiveness
effectiveness.
effects
effects),
effects,
effects.
effects;
efficacy
efficacy,
efficacy.
efficient
efficiently
eg,
egf
egf-
egf.
egfr
egg
eia
eight
eight-fold
either
el
elapse
elc.)
eldepryl
eldepryl),
eldepryl.
elderly
elderly,
electrocardiographic
electrolyte
electrolytes.
electrophysiologic
electroretinograms
elemental
elements
elements;ethacrynic
elevate
elevated
elevating
elevation
elevations
elevations,
eleven
elicit
elicited
elicits
eliminate
eliminated
elimination
elimination,
elimination.
elimination.14
